Turbulence/Project_turbulence/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       latestTime; // or change it for a "restart-like" -> latestTime;

startTime       0;

stopAt          endTime;

endTime         0.4;

deltaT          4e-07;

writeControl    runTime;

writeInterval   0.004;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    libs            (fieldFunctionObjects);

    Ma
    {
        type            MachNo;
        executeControl  writeTime;
        writeControl    writeTime;
    }



//	#includeFunc residuals




probes
{
        type probes;
        probeLocations
        (
        (1.3557 0 0.05)
        );
        fields
        (p U);

        writeControl       timeStep;
        writeInterval      1;
}
}
//functions
//{
////    #includeFunc residuals
//    //residuals
//    //{
//    //    type            solverInfo;
//    //    libs            (utilityFunctionObjects);
//    //    fields          (".*");
//    //}
//
//}

// functions
// {
//      Use the scalarTransport function to get the white stripes 
//      as given in the video. Furthermore, use fvConstraints to add a source
//      term to defined locations respectively cells.
//      For the fvConstraints you need at least the OpenFOAM commit:
//      987d5906ef2e29c711d98b15ff400e5dedcf4500
//      -> This commit resolves the issue of using fvConstraints while using
//      
// };
//}

// ************************************************************************* //
