Turbulence/Project_turbulence/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

vertices        
(
    // Side of the nozzle at z=0
    (0  35.2  0)	//0
    (20  35.2  0)	//1
    (43.29  29.54  0)	//2
    (70.5  15.52  0)	//3
    (80.81  14.05  0)	//4
    (135.57  24.68  0)	//5

    (0  0  0)	//6
    (20  0  0)	//7
    (43.29  0  0)	//8
    (70.5  0  0)	//9
    (80.81  0  0)	//10
    (135.57  0  0)	//11

    // Side of the nozzle at z=0.01
    (0  35.2  10)	//12
    (20  35.2  10)	//13
    (43.29  29.54  10)	//14
    (70.5  15.52  10)	//15
    (80.81  14.05  10)	//16
    (135.57  24.68  10)	//17 

    (0  0  10)	//18
    (20  0  10)	//19
    (43.29  0  10)	//20
    (70.5  0  10)	//21
    (80.81  0  10)	//22
    (135.57  0  10)	//23 

    // Domaine boundaries
    (1821.57  24.68  0)   //24
    (1821.57  0 0)   //25
    (1821.57  0 10)   //26
    (1821.57  24.68  10)   //27
    (135.57  562  0)   //28
    (135.57  562  10)   //29
    (1821.57 562  10)   //30
    (1821.57 562  0)   //31

);

blocks          
(
   // Five blocks in the nozzle:
    hex (6 7 1 0 18 19 13 12) (25 30 1) // block 0
    simpleGrading
    (1		// X dir
     (
      	(0.97 0.5 0.1)	// 96% of geo (BL) covers 50% of cells
	(0.03 0.5 0.005) 	// 4% of geo (outside the BL) cover 50% of cells
     )      // Y dir
     1) 	// Z dir

    hex (7 8 2 1 19 20 14 13) (23 30 1) // block 1
    simpleGrading
    (1		// X dir
     (
       	(0.97 0.5 0.1)	
	(0.03 0.5 0.005) 
     )      // Y dir
     1) 	// Z dir

    hex (8 9 3 2 20 21 15 14) (30 30 1) // block2
    simpleGrading
    (1		// X dir
     (
      	(0.97 0.5 0.1)	
	(0.03 0.5 0.005) 
       )      // Y dir
     1) 	// Z dir

    hex (9 10 4 3 21 22 16 15) (21 30 1)
    simpleGrading
    (1		// X dir
     (
       	(0.97 0.5 0.1)	
	(0.03 0.5 0.005) 
      )      // Y dir
     1) 	// Z dir

    hex (10 11 5 4 22 23 17 16) (77 30 1)
    simpleGrading
    (1		// X dir
     (
       	(0.97 0.5 0.1)	
	(0.03 0.5 0.005) 
)      // Y dir
     1) 	// Z dir

    // Blocks of the outer region:
    hex (11 25 24 5 23 26 27 17) (200 30 1) 
    simpleGrading
    (18		// X dir
     (
       	(0.97 0.5 0.1)	
	(0.03 0.5 0.005) 
)      // Y dir
     1) 	// Z dir

    hex (5 24 31 28 17 27 30 29) (200 100 1) simpleGrading (18 15 1)
);

edges           
( 
    // Arcs at the upper side of the nozzle:
    arc 1 2 c (20 -15.59 0)
    arc 13 14 c (20 -15.59 10) 

    arc 3 4 c (80.81 50.94013605 0)
    arc 15 16 c (80.81 50.94013605 10)
);

boundary       
(

    inlet
    {
	type patch;
        faces ((0 6 18 12));
    }

    // Nozzle upper wall
    upperWall
    {
	type wall;
        faces
       	(
	       (0 1 13 12)
	       (1 2 14 13)
	       (2 3 15 14)
	       (3 4 16 15)
	       (4 5 17 16)
	);
    }


    // Farfield and outlet:
    farfield
    {
	type patch;
        faces (
		(28 5 17 29)
		(28 29 30 31)
	      );
    }

    outlet
    {
	type patch;
	faces (
		(24 31 30 27)
		(25 24 27 26)
	      );
    }

/* Sides of the domain generated by the 3D config of OpenFOAM:
 */

    back
    {
	type empty;
	faces
	(
	 // side at z= zmin
	 (6 7 1 0)
	 (7 8 2 1)
	 (8 9 3 2)
	 (9 10 4 3)
	 (10 11 5 4)
	 (11 25 24 5)
	 (5 24 31 28)
	);
    }
    
    front
    {
	type empty;
        faces	
	(
	 // side at z = zmax
	 (18 19 13 12)
	 (19 20 14 13)
	 (20 21 15 14)
	 (21 22 16 15)
	 (22 23 17 16)
	 (23 26 27 17)
	 (17 27 30 29)
	);
    }

    symmetry
    {
	type symmetryPlane;
	faces
	(
	 (6 7 19 18)
	 (7 8 20 19)
	 (8 9 21 20)
	 (9 10 22 21)
	 (10 11 23 22)
	 (11 25 26 23)
	);
    }
 
 
);
/* mergePatchPairs 
(
    (interface1 interface2)
); */

// ************************************************************************* //
