Turbulence/Project_turbulence/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
////////tangentialVelocity	uniform (0 0 0);
////////value           uniform (162 0 0);
    }

    outlet
    {
        type            waveTransmissive;
	gamma		1.4;
    }

    farfield
    { 
        type            waveTransmissive;
	gamma		1.4;
   }

    symmetry
    {
        type            symmetryPlane;
    }

    upperWall
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
