Turbulence/Project_turbulence/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            totalPressure;
	gamma		1.4;
	p0		uniform 170000;	
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        100000;
        lInf            3;
//	type		fixedValue;
//      value           $internalField;
    }

    farfield
    {
      type            waveTransmissive;
      field           p;
      psi             thermo:psi;
      gamma           1.4;
      fieldInf        100000;
      lInf            3;
      value           uniform 100000;
//    type		fixedValue;
//    value		$internalField;
    }



    symmetry
    {
        type            symmetryPlane;
    }

    upperWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
