Turbulence/Project_turbulence/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288;

boundaryField
{
    inlet
    {
        type            totalTemperature;
	gamma		1.4;
        T0           	uniform 300;
    }

    outlet
    {
        type            waveTransmissive;
        field           T;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        300;
        lInf            3;

    }

    farfield
    {
        type            waveTransmissive;
        field           T;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        300;
        lInf            3;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    upperWall
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
