Turbulence/Project_turbulence/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 7.11;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7.11;
    }

    "(outlet|farfield)"
    {
        type            inletOutlet;
        inletValue      uniform 7.11;
        value           uniform 7.11;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    upperWall
    {
        type            epsilonWallFunction;
        value           uniform 7.11;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
