Turbulence/Project_turbulence/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
	intensity	0.05;
        value           uniform 5;
    }

    "(outlet|farfield)"
    {
        type            inletOutlet;
        inletValue      uniform 5;
        value           uniform 5;
    }

    symmetry
    {
        type            symmetryPlane;
    }
 

    upperWall
    {
        type            uniformFixedValue;
        uniformValue	0;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
