Turbulence/Project_turbulence/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 14.07;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
	mixingLength	0.0014;
        value           $internalField;
    }

    "(outlet|farfield)"
    {
        type            inletOutlet;
	inletValue	uniform 14.07;
	value		uniform 14.07;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    upperWall
    {
        type             zeroGradient;
//        value           $internalField;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //
