Turbulence/Project_turbulence/system/probe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probes
{
// Where to load it from
functionObjectLibs ( "libsampling.so" );

type        probes;

// Name of the directory for probe data
name        probes;

// Fields to be probed
fields (
        p 
        U 
       );

probeLocations
(
   ( 10 0. 0. )         // in the cylinder wake
   //(  0.5   0. 1.351)         // at top of the helmet
   //(  1.745 0. 1.01 )         // at tail of the motorbike

);
}
// ************************************************************************* //
